// Auto-generated from stems-branches.json
export default {
    "heavenlyStems": ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"],
    "earthBranches": ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"],
    "opposites": {
        "子": "午",
        "丑": "未",
        "寅": "申",
        "卯": "酉",
        "辰": "戌",
        "巳": "亥",
        "午": "子",
        "未": "丑",
        "申": "寅",
        "酉": "卯",
        "戌": "辰",
        "亥": "巳"
    },
    "sanFangSiZheng": {
        "子": ["子", "辰", "申", "午"],
        "丑": ["丑", "巳", "酉", "未"],
        "寅": ["寅", "午", "戌", "申"],
        "卯": ["卯", "未", "亥", "酉"],
        "辰": ["辰", "申", "子", "戌"],
        "巳": ["巳", "酉", "丑", "亥"],
        "午": ["午", "戌", "寅", "子"],
        "未": ["未", "亥", "卯", "丑"],
        "申": ["申", "子", "辰", "寅"],
        "酉": ["酉", "丑", "巳", "卯"],
        "戌": ["戌", "寅", "午", "辰"],
        "亥": ["亥", "卯", "未", "巳"]
    },
    "branchToIndex": {
        "子": 0, "丑": 1, "寅": 2, "卯": 3,
        "辰": 4, "巳": 5, "午": 6, "未": 7,
        "申": 8, "酉": 9, "戌": 10, "亥": 11
    },
    "stemToIndex": {
        "甲": 0, "乙": 1, "丙": 2, "丁": 3, "戊": 4,
        "己": 5, "庚": 6, "辛": 7, "壬": 8, "癸": 9
    }
};
