// Auto-generated from palace-order.json
export default 
{
  "palaceNames": [
    "命宮", "兄弟宮", "夫妻宮", "子女宮", "財帛宮", "疾厄宮",
    "遷移宮", "交友宮", "官祿宮", "田宅宮", "福德宮", "父母宮"
  ],
  "palaceOrder": {
    "命宮": 0,
    "兄弟宮": 1,
    "夫妻宮": 2,
    "子女宮": 3,
    "財帛宮": 4,
    "疾厄宮": 5,
    "遷移宮": 6,
    "交友宮": 7,
    "官祿宮": 8,
    "田宅宮": 9,
    "福德宮": 10,
    "父母宮": 11
  },
  "opposites": {
    "命宮": "遷移宮",
    "兄弟宮": "交友宮",
    "夫妻宮": "官祿宮",
    "子女宮": "田宅宮",
    "財帛宮": "福德宮",
    "疾厄宮": "父母宮",
    "遷移宮": "命宮",
    "交友宮": "兄弟宮",
    "官祿宮": "夫妻宮",
    "田宅宮": "子女宮",
    "福德宮": "財帛宮",
    "父母宮": "疾厄宮"
  }
}
;
